Repository: vakesz/Glasstual
Catalog: Sources/App/Features/AddressBook/AddressBook.xcstrings
Source language: en
Languages: de, hu

source: Display message when user becomes available
de: Meldung anzeigen, wenn der Benutzer verfügbar wird
hu: Üzenet megjelenítése, ha a felhasználó elérhetővé válik

source: Enter a hostmask to ignore
de: Zu ignorierende Hostmaske eingeben
hu: Add meg a mellőzendő címmaszkot

source: Enter any nickname to track
de: Zu beobachtenden Nicknamen eingeben
hu: Add meg a követendő becenevet

source: Examples
de: Beispiele
hu: Példák

source: File transfer requests
de: Dateiübertragungsanfragen
hu: Fájlátviteli kérések

source: General event messages
de: Allgemeine Ereignismeldungen
hu: Általános eseményüzenetek

source: Hostmask
de: Hostmaske
hu: Címmaszk

source: Hostmask format and examples
de: Hostmaskenformat und Beispiele
hu: Címmaszk formátuma és példák

# ignore-description
source: Choose which message types Glasstual should ignore from a matching user.
de: Wähle, welche Nachrichtentypen Glasstual von passenden Benutzern ignorieren soll.
hu: Válaszd ki, milyen üzenettípusokat mellőzzön a Glasstual az illeszkedő felhasználóktól.

source: Ignore User
de: Benutzer ignorieren
hu: Felhasználó mellőzése

# ignored-messages
source: Messages to Ignore
de: Zu ignorierende Nachrichten
hu: Mellőzendő üzenetek

source: Inline media
de: Eingebettete Medien
hu: Beágyazott média

# matches-addresses-ending-in-info
source: *!*@*.info (matches any address ending in “.info”)
de: *!*@*.info (passt auf alle Adressen mit der Endung ".info")
hu: *!*@*.info (minden ".info" végű címre illeszkedik)

# matches-every-possible-user
source: *!*@* (matches every possible user — not recommended)
de: *!*@* (passt auf alle Benutzer, nicht empfohlen)
hu: *!*@* (minden felhasználóra illeszkedik, nem ajánlott)

# matches-nicknames-starting-with-frank
source: frank*!*@* (matches any nickname that starts with “frank”)
de: frank*!*@* (passt auf alle Nicknamen, die mit "frank" beginnen)
hu: frank*!*@* (minden "frank" kezdetű becenévre illeszkedik)

# matches-username-matt
source: *!matt@* (matches any username equal to “matt”)
de: *!matt@* (passt auf den Benutzernamen "matt")
hu: *!matt@* (a "matt" felhasználónévre illeszkedik)

source: Notice messages
de: Hinweismeldungen
hu: Értesítési üzenetek

# please-enter-a-properly-formatted-ignore
source: Enter a hostmask, such as nickname!username@address.
de: Gib eine Hostmaske wie nickname!username@address ein.
hu: Adj meg egy címmaszkot, például nickname!username@address.

source: Private highlights
de: Private Hervorhebungen
hu: Privát említések

source: Private messages
de: Private Nachrichten
hu: Privát üzenetek

source: Public highlights
de: Öffentliche Hervorhebungen
hu: Nyilvános említések

source: Public messages
de: Öffentliche Nachrichten
hu: Nyilvános üzenetek

source: Track User
de: Benutzer beobachten
hu: Felhasználó követése

# tracking-description
source: Track when a nickname becomes available on this network.
de: Beobachte, wann ein Nickname in diesem Netzwerk verfügbar wird.
hu: Kövesd, mikor válik elérhetővé egy becenév ezen a hálózaton.

# tracking-method-description
source: Glasstual watches join, part, and quit activity in shared channels. When the server supports them, it also uses ISON, MONITOR, or WATCH to check availability outside shared channels.
de: Glasstual beobachtet Beitritte, Austritte und Verbindungsabbrüche in gemeinsamen Kanälen. Falls der Server sie unterstützt, werden auch ISON, MONITOR oder WATCH verwendet, um die Verfügbarkeit außerhalb gemeinsamer Kanäle zu prüfen.
hu: A Glasstual figyeli a közös csatornákon a csatlakozásokat és kilépéseket. Ha a kiszolgáló támogatja, az ISON, MONITOR vagy WATCH parancsokkal a közös csatornákon kívül is ellenőrzi az elérhetőséget.

source: User Ignore
de: Benutzer ignorieren
hu: Felhasználók mellőzése

source: User Tracking
de: Benutzer beobachten
hu: Felhasználók követése

source: Client-to-client (CTCP)
hu: Kliensközi üzenetek (CTCP)

source: Format
hu: Formátum

source: Nickname
hu: Becenév
